"""
++++++++++++++++++++++++++++++++++++++++++++++++
Методы строк
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Работа с регистром
================================================
Создай строку s = "Python для автоматизации".
Преобразуй строку в верхний регистр и выведи результат.
Преобразуй строку в нижний регистр и выведи результат.
================================================
"""
from operator import index

s = 'Python для автоматизации'
print(s.upper())
print(s.lower())
print('----------------')
"""
2. Подсчет вхождений подстроки
================================================
Создай строку msg = "абракадабра".
Найди, сколько раз встречается подстрока "ра" в строке msg.
Определи количество "а", начиная с 3-го символа.
================================================
"""
msg = 'абракадабра'
print(msg.count('ра'))
print(msg.count('а',2))
print('----------------')
"""
3. Поиск подстроки
================================================
Определи индекс первого вхождения "ка" в строке "абракадабра".
Найди индекс последнего вхождения "а".
Проверь, что произойдет, если искать "xyz" в строке.
================================================
"""
print(msg) # для удобства
print(msg.index('ка'))
print(msg.index('а', -1))
# print(msg.index('xyz'))  - ValueError: substring not found - Лучше использовать find
print('----------------')
"""
4. Замена подстроки
================================================
Создай строку text = "Я изучаю Java".
Замени "Java" на "Python".
Удали все пробелы из строки.
================================================
"""
text = 'Я изучаю Java'
print(text.replace('Java', 'Python'))
print(text.replace(' ', ''))
print('----------------')
"""
5. Проверка содержимого строки
================================================
Проверь, состоит ли строка "Python" только из букв.
Проверь, состоит ли строка "12345" только из цифр.
Проверь, что строка "123abc" не состоит только из цифр.
================================================
"""
print('Python'.isalpha())
print('12345'.isnumeric())
print(not '123abc'.isnumeric())
print('----------------')
"""
6. Дополнение строк
================================================
Создай строку code = "42", дополни её до 5 символов слева нулями.
Выравнивай строку "text" по ширине 10, добавляя * справа.
================================================
"""
code = '42'
print(code.rjust(5,'0'))
print('text'.ljust(10,'*'))
print('----------------')
"""
7. Разбиение строк
================================================
Разбей строку "яблоко, груша, банан" на список слов.
Разбей "Python;Java;C++" по ";".
================================================
"""
print('яблоко, груша, банан'.split(', '))
print('Python;Java;C++'.split(';'))
print('----------------')
"""
8. Объединение списка в строку
================================================
Соедини список ["Привет", "мир", "!"] в строку с пробелами.
Преобразуй список ["apple", "banana", "cherry"] в строку через ", ".
================================================
"""
print(' '.join(["Привет", "мир", "!"]))
print(', '.join(["apple", "banana", "cherry"]))
print('----------------')
"""
9. Удаление пробелов
================================================
Удали пробелы слева в строке " Python".
Удали пробелы справа в строке "Python ".
Удали пробелы с обеих сторон в строке " Python ".
================================================
"""
print(" Python".lstrip())
print("Python ".rstrip())
print(" Python ".strip())
print('----------------')
"""
10. Дополнительное задание
================================================
Создай строку text = "программирование", сделай первую букву заглавной.
Найди количество букв "р" в этой строке.
Выведи индекс первой буквы "и".
Разверни строку и выведи результат.
++++++++++++++++++++++++++++++++++++++++++++++++
"""
text = 'Программирование'
print(text.capitalize())
print(text.count('р'))
print(text.find('и'))
print(text[::-1])
print('----------------')
"""
Спецсимволы
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Перевод строки
================================================
Создай строку text = "Hello\nPython".
Выведи её на экран. Объясни, почему "Python" перешел на новую строку.
================================================
"""
text = 'Hello\nPython'
print(text)#"Python" перешел на новую строку потому что мы добавили символ перехода на новую строку (\n)
print('----------------')
"""
2. Горизонтальная табуляция
================================================
Создай строку t = "Python\tAutomation".
Выведи её и объясни, что делает \t.
================================================
"""
t = 'Python\tAutomation'
print(t)# Добавили символ табуляции (в моем случае 4 пробела)
print('----------------')
"""
3. Экранирование символов
================================================
Создай строку path = "C:\new\test.txt" и выведи её. Что произошло?
Исправь ошибку, используя экранирование.
Выведи строку "Марка вина "Ягодка"" так, чтобы кавычки внутри строки были корректными.
================================================
"""
path = "C:\new\test.txt"
print(path)# символы съело, нужно экранировать
path_2 = "C:\\new\\test.txt"
print(path_2)
print("Марка вина \"Ягодка\"")
print('----------------')
"""
4. Сырые (raw) строки
================================================
Создай строку path = r"C:\new\test.txt" и выведи её.
Объясни разницу между обычной и сырой строкой.
================================================
"""
path = r"C:\new\test.txt"
print(path)
# сырые строки распознают "\" как обычный символ
print('----------------')
"""
5. Использование разных спецсимволов
================================================
Создай строку s = "Hello\b World" и выведи её. Что произошло?
Создай строку s = "Hello\fPython" и выведи её.
================================================
"""
s = "Hello\b World"
print(s)
# \b стер 1 предшествующий ему символ (backspace)
s_2 = "Hello\fPython"
print(s_2)
# \f - символ перехода на новую страницу при печати
print('----------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Форматирование строк
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Формирование строк через конкатенацию
================================================
Создай переменные имя и возраст.
Сформируй строку "Меня зовут {имя}, мне {возраст} лет." с помощью оператора + и выведи её.
Попробуй добавить число в строку без str(). Что произойдёт?
================================================
"""
name = 'Игорь'
age  = 27
print('Меня зовут ' + name ,', мне ' + str(age), 'лет')
# без str выдает ошибку 'can only concatenate str (not "int") to str'
print('----------------')
"""
2. Форматирование строк с .format()
================================================
Используя .format(), сформируй строку "Привет, меня зовут {имя}, мне {возраст} лет.".
Используй .format() с именованными параметрами ({name}, {age}).
Попробуй изменить порядок переменных в .format() и выведи строку.
================================================
"""
print("Привет, меня зовут {}, мне {} лет.".format('Игорь', 25))
print("Привет, меня зовут {name}, мне {age} лет.".format(name='Игорь', age=25))
print("Привет, меня зовут {name}, мне {age} лет.".format(age=25, name='Игорь'))
print('----------------')
"""
3. Использование F-строк
================================================
Создай переменные город и год.
Выведи строку "Сегодня {год} год, и я живу в {город}." с помощью F-строки.
Используй F-строку, чтобы вывести "Через 5 лет будет {год + 5} год.".
================================================
"""
city = 'Tokyo'
year = 2009
print(f'Сегодня {year} год, и я живу в {city}.')
print(f'Через 5 лет будет {year + 5} год.')
print('----------------')
"""
4. Операции внутри F-строк
================================================
Выведи "Дважды мой возраст: {...}", используя F-строку.
Применяй .upper() к переменной, чтобы вывести имя в верхнем регистре.
================================================
"""
age2 = 15
name2 = 'Sebastyan'
print(f'Дважды мой возраст: {age2 * 2}')
print(f'Имя в верхнем регистре: {name2.upper()}')
print('----------------')
"""
5. Дополнительное задание
================================================
Используя .format(), сформируй строку "Курс валют: 1 доллар = 92.5 рубля.", подставляя переменные.
Используя F-строку, сформируй "Квадрат числа 7 равен 49.", вычисляя 7 ** 2 прямо внутри строки.
"""
print('Курс валют: 1 доллар = {} рубля.'.format(92.5))
print(f'Квадрат числа 7 равен {7 ** 2}.')