"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задачи по итераторам
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Пройти по списку с помощью итератора
Создайте итератор для списка и выведите все его элементы с использованием next().
===============================================
"""
lst = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
it_lst = iter(lst)
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print(next(it_lst))
print('--------------')
"""
2. Итератор для строки
Используйте iter() и next() для посимвольного вывода строки.
"""
name = 'Stroka'
it_name = iter(name)
print(next(it_name))
print(next(it_name))
print(next(it_name))
print(next(it_name))
print(next(it_name))
print(next(it_name))
print('--------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задачи по теме "Генераторы списков (List Comprehensions)"
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Создайте список из квадратов чисел от 1 до N, используя list comprehension.
===============================================
"""
N = 6
kvadraty = [num ** 2 for num in range(1,N + 1)]
print(kvadraty)
print('--------------')
"""
2. Сформируйте список, содержащий только четные числа в диапазоне от -10 до 10.
===============================================
"""
lst = [num for num in range(-10,11) if num % 2 == 0]
print(lst)
"""
3. Дан список слов. Создайте новый список, содержащий длины всех слов, используя генератор списков.
===============================================
"""
slova = ['Pervoe', 'Vtoroe', 'Tretee', 'Chetvertoe']
new = [len(i) for i in slova]
print(new)

"""
4. Создайте список из чисел от 1 до 20, где вместо четных чисел будет "четное", а вместо нечетных — "нечетное" (используйте тернарный оператор)
===============================================
"""
result = ['Четное' if word % 2 == 0 else 'Нечетное' for word in range(1, 21)]
print(result)
"""
5. Проверка, является ли объект итерируемым
Создайте список внутри которого 3 объекта: число, строка и список.
Создайте генератор в котором будет написано True - если объект является итерируемым или False - если нет.
"""
pumpurum = [17, 'Stroka', [1, 5, 12]]
generator = ['False' if type(k) == int else 'True' for k in pumpurum]
print(generator)