"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме isinstance(), filter()
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
1. Оставь только строки и списки из списка:
items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
Ожидаемый результат:
['hello', [1, 2], 'world']
===============================================
"""
print('Задание 1')
items = [5, "hello", [1, 2], 3.14, {"a": 1}, "world"]
itog = []
for i in items:
    if isinstance(i, str):
        itog.append(i)
    elif isinstance(i, list):
        itog.append(i)

print(itog)

print('---------------------------------------------')
"""
2. Создай функцию describe_type(x), которая:
печатает "Это строка", если x — строка
"Это число", если x — int или float
"Это булевое значение", если x — bool
"Неизвестный тип" — в остальных случаях
Пример вызова:
describe_type(5.5)       # Это число
describe_type(True)      # Это булево значение
describe_type("Привет")  # Это строка
describe_type([1, 2, 3]) # Неизвестный тип
===============================================
"""
print('Задание 2')
def describe_type(x):
    if isinstance(x, str):
        print('Это строка')
    elif isinstance(x, bool):
        print('Это булево значение')
    elif isinstance(x, (int, float)):
        print('Это число')
    else:
        print('Неизвестный тип')

describe_type(5.5)       # Это число
describe_type(True)      # Это булево значение
describe_type("Привет")  # Это строка
describe_type([1, 2, 3]) # Неизвестный тип

print('---------------------------------------------')

"""
3. Создай функцию filter_list(f, data: list[int]) -> list[int],
которая возвращает только те элементы из data, которые проходят проверку функцией f.
Проверь на функции lambda x: x > 3 и списке [1, 3, 5, 7].
===============================================
"""
print('Задание 3')
def filter_list(f, data: list[int]) -> list[int]:
    res_list = []
    for i in data:
        if f(i):
            res_list.append(i)
    return res_list

print(filter_list(lambda x: x > 3, [1, 3, 5, 7]))

print('---------------------------------------------')

"""
4. Добавь аннотацию типов в следующую функцию и укажи, что она возвращает None:
def print_info(name, age, tags):
    print(name, age, tags)
===============================================
"""
print('Задание 4')

def print_info(name: str, age: int, tags: list[str]) -> None:
    print(name, age, tags)

print_info('Gennadiy', 23, ['Molodec', 'Engineer'])

print('---------------------------------------------')

"""
5. Создай функцию def analyze(data),
которая выводит количество элементов и среднее значение, если список не пустой.
===============================================
"""
print('Задание 5')

def analyze(data: list[int]):
    if not data:
        print('Список пустой')
        return None
    summa = 0
    for i in data:
        summa += i
    print(f'Количество элементов: {len(data)}')
    print(f'Среднее значение: {summa / len(data)}')

analyze([1, 4, 6, 11])



print('---------------------------------------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме all() и any()
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
6. Список логических значений:
flags = [True, True, True, False]
Проверь:
Все ли значения истинные
Есть ли среди них хотя бы одно истинное
Ожидаемый результат:
False
True
===============================================
"""
print('Задание 6')

flags = [True, True, True, False]
print(all(flags))
print(any(flags))

print('---------------------------------------------')

"""
7. Поле в игре "Крестики-нолики" представлено так:
field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
Проверь, победил ли 'x' по первой строке.
Ожидаемый результат:
True
===============================================
"""
print('Задание 7')

field = ['x', 'x', 'x', 'o', 'o', '', '', '', '']
win = all(i == 'x' for i in field[:3])
print(win)

print('---------------------------------------------')
"""
8. На поле для "Сапёра" находится мина, если в ячейке символ *. Есть ли мина?
P = ['0', '0', '0', '*', '0']
Ожидаемый результат:
True
===============================================
"""
print('Задание 8')

P = ['0', '0', '0', '*', '0']
mina = any(i == '*' for i in P)
print(mina)

print('---------------------------------------------')

"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме random
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================
9. Выбери случайное значение из списка:
colors = ["red", "green", "blue", "yellow", "purple"]
Ожидаемый результат:
Выбран цвет: blue
===============================================
"""
print('Задание 9')

import random

colors = ["red", "green", "blue", "yellow", "purple"]
color = random.choice(colors)
print(f'Выбран цвет: {color}')

print('---------------------------------------------')
"""
10. Сгенерируй 10 случайных чисел от 0 до 100 и выведи их. Сделай так, чтобы результат был одинаковый при каждом запуске.
===============================================
"""
print('Задание 10')

random.seed(12)
for i in range(10):
    num = random.randint(0, 100)
    print(num, end=' ')

print('\n---------------------------------------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Задания по теме "Аннотация типов в Python"
++++++++++++++++++++++++++++++++++++++++++++++++
===============================================

11. Напиши функцию greet(), которая принимает строку name и возвращает строку Привет, <name>!.
Добавь аннотацию типов.
Ожидаемый вывод:
Привет, Анна!
===============================================
"""
print('Задание 11')

def greet(name: str) -> str:
    return f'Привет, {name}!'

print(greet('Анна'))

print('---------------------------------------------')
"""
12. Создай функцию multiply(a, b), которая принимает два числа int или float и возвращает их произведение.
Добавь аннотацию типов.
Ожидаемый вывод:
20
"""
print('Задание 12')

def multiply(a: int | float, b: int | float) -> int | float:
    return a * b

print(multiply(2.4, 4.7))

print('---------------------------------------------')
"""
13. Проверь типы аргументов функции через __annotations__.
Создай функцию area(length: float, width: float) -> float и распечатай её аннотации.
Ожидаемый вывод:
{'length': <class 'float'>, 'width': <class 'float'>, 'return': <class 'float'>}
"""
print('Задание 13')

def area(length: float, width: float) -> float:
    pass

print(area.__annotations__)