"""
++++++++++++++++++++++++++++++++++++++++++++++++
Списки
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Создание списков
================================================
Создай список cities с элементами: "Москва", "Тверь", "Вологда".
Создай список numbers с целыми числами от 1 до 5.
Создай список mixed с элементами разных типов: число, строка, булево значение, вещественное число.
================================================
"""
from dataclasses import replace

cities = ["Москва", "Тверь", "Вологда"]
numbers = [1, 2, 3, 4, 5]
mixed = [17, 'весна', True, 23.7]

"""
2. Доступ к элементам списка
================================================
Выведи первый элемент списка cities.
Выведи последний элемент списка numbers с помощью отрицательного индекса.
Попробуй получить элемент с индексом 10 из cities. Что произойдет?
================================================
"""
print(cities[0])
print(cities[-1])
# print(cities[10])  //list index out of range
print('----------------')
"""
3. Изменение элементов списка
================================================
Замени второй элемент списка numbers на 10.
Замени последний элемент списка mixed на "Python".
================================================
"""
print(numbers)
numbers[1] = 10
print(numbers)
print(mixed)
mixed[-1] = 'Python'
print(mixed)
print('----------------')
"""
4. Функции для работы со списками
================================================
Выведи длину списка numbers.
Найди максимальное и минимальное значение в numbers.
Вычисли сумму всех элементов списка numbers.
Отсортируй список numbers по возрастанию и убыванию.
================================================
"""
print(numbers)
print(len(numbers))
print(max(numbers), min(numbers))
print(sum(numbers))
print(sorted(numbers))
print(sorted(numbers, reverse=True))
print('----------------')
"""
5. Операции со списками
================================================
Объедини два списка [1, 2, 3] и [4, 5].
Продублируй список ["Python", "is", "awesome"] три раза.
================================================
"""
print([1, 2, 3] + [4, 5])
print(["Python", "is", "awesome"] * 3)
print('----------------')
"""
6. Проверка вхождения
================================================
Проверь, содержится ли число 3 в списке numbers.
Проверь, содержится ли "Москва" в cities.
Проверь, содержится ли [1, 2] в mixed.
================================================
"""
print(numbers)
print(3 in numbers)
print(cities)
print('Москва' in cities)
print(mixed)
print([1, 2] in mixed)
print('----------------')
"""
7. Удаление элементов
================================================
Удали третий элемент из numbers.
Удали последний элемент из cities с помощью del.
================================================
"""
print(numbers)
del numbers[2]
print(numbers)
print(cities)
del cities[-1]
print(cities)
print('----------------')
"""
8. Дополнительное задание
================================================
Преобразуй строку "Python" в список символов.
Найди максимальный и минимальный символ в этом списке.
Попробуй сложить все элементы списка. Что произойдет?
"""
print(list('Python'))
print(id('y'), id('P'))
print(max(list('Python')))
print(min(list('Python')))
# print(sum(list('Python')))  //Складывать строки в списке нельзя
print('----------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Срезы списков
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Создание и копирование списков
================================================
Создай список с городами.
Создай копию списка с помощью среза.
Проверь, является ли оригинальный список и его копия разными объектами.
================================================
"""
cities2 = ['Kinshasa', 'Brisben', 'Vologda', 'Ottawa']
cities3 = cities2[:]
print(id(cities3), id(cities3), cities2 == cities3)
# cities3[0] = 'NEGOROD'
# print(cities2)
# print(cities3)
print('----------------')
"""
2. Извлечение элементов с помощью срезов
================================================
Выведи 2-й и 3-й элементы списка с городами.
Выведи все элементы, начиная с 3-го.
Выведи первые три элемента.
Выведи весь список через срез.
Используй отрицательные индексы для выбора последних двух элементов.
================================================
"""
print(cities2)
print(cities2[1:3])
print(cities2[2:])
print(cities2[:3])
print(cities2[:])
print(cities2[-2:])
print('----------------')
"""
3. Использование шагов в срезах
================================================
Выведи каждый второй элемент списка с городам.
Выведи список в обратном порядке.
Выведи каждый второй элемент с конца.
================================================
"""
print(cities2)
print(cities2[1::2])
print(cities2[::-1])
print(cities2[::-1][1::2])
print('----------------')
"""
4. Изменение элементов списка через срезы
================================================
Замени 2-й и 3-й элементы списка с городами на "Сочи" и "Нижний Новгород".
Замени каждый второй элемент на "Город".
Присвой новые значения кортежем: cities[1:3] = "Волгоград", "Омск".
================================================
"""
print(cities2)
cities2[1:3] = 'Сочи', 'Нижний Новгород'
print(cities2)
cities2[1::2] = ['Город']* (len(cities2) // 2)
print(cities2)
cities2[1:3] = "Волгоград", "Омск"
print(cities2)
print('----------------')
"""
5. Операции с объединением списков
================================================
Объедини два списка [1, 2, 3] и [4, 5, 6].
Продублируй список ["Python", "rocks"] два раза.
================================================
"""
print([1, 2, 3] + [4, 5, 6])
print(["Python", "rocks"] * 2)
print('----------------')
"""
6. Сравнение списков
================================================
Сравни [1, 2, 3] и [1, 2, 3] – равны ли они?
Проверь, что [10, 5, 3] > [5, 10, 3].
Попробуй сравнить [1, 2, 3] и [1, 2, "abc"]. Что произойдет?
================================================
"""
print([1, 2, 3] == [1, 2, 3])
print([10, 5, 3] > [5, 10, 3])
# print([1, 2, 3] > [1, 2, "abc"])  //not supported between instances of 'int' and 'str'
print('----------------')
"""
7. Дополнительное задание
================================================
Создай список chars = list("Python").
Выведи максимальный и минимальный символ в этом списке.
Попробуй сложить все элементы списка chars. Объясни результат.
"""
chars = list("Python")
print(chars)
print(max(chars), min(chars))
# print(sum(chars))  //Складывать строки в списке нельзя
print('----------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Методы списков
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Добавление элементов
================================================
Создай список numbers = [5, 10, 15].
Добавь в конец списка число 20 с помощью append().
Вставь число 7 на второе место списка с помощью insert().
Добавь строку "Python" в список numbers.
================================================
"""
numbers = [5, 10, 15]
print(numbers)
numbers.append(20)
print(numbers)
numbers.insert(1,7)
print(numbers)
numbers.append('Python')
print(numbers)
print('----------------')
"""
2. Удаление элементов
================================================
Удали число 10 из списка с помощью remove().
Удали последний элемент списка и выведи его (pop()).
Удали элемент с индексом 1 с помощью pop().
Очисти весь список numbers.
================================================
"""
print(numbers)
numbers.remove(10)
print(numbers)
print(numbers.pop())
print(numbers.pop(1))
print(numbers.clear())
print('----------------')
"""
3. Копирование списков
================================================
Создай список letters = ["a", "b", "c"].
Создай копию списка с помощью copy() и list().
Проверь, являются ли оригинальный список и копия разными объектами.
================================================
"""
letters = ["a", "b", "c"]
letters2 = letters.copy()
print(id(letters), id(letters2))
letters3 = list(letters)
print(id(letters), id(letters3))
print('----------------')
"""
4. Поиск элементов
================================================
Создай список marks = [2, 3, 5, 3, 4, 5, 2, 3].
Определи, сколько раз встречается число 3 в списке (count()).
Найди индекс первого вхождения числа 5 (index()).
Проверь, содержится ли число 6 в списке перед вызовом index().
================================================
"""
marks = [2, 3, 5, 3, 4, 5, 2, 3]
print(marks)
print(marks.count(3))
print(marks.index(5))
if 6 in marks:
    print(marks.index(5))
else:
    print('Число 6 не находится в списке')
print('----------------')
"""
5. Изменение порядка элементов
================================================
Создай список nums = [8, 2, 5, 1, 7].
Отсортируй его по возрастанию (sort()).
Отсортируй его по убыванию (sort(reverse=True)).
Разверни список (reverse()).
================================================
"""
nums = [8, 2, 5, 1, 7]
nums.sort()
print(nums)
nums.sort(reverse=True)
print(nums)
nums.reverse()
print(nums)
print('----------------')
"""
6. Сортировка строк
================================================
Создай список cities.
Отсортируй его в алфавитном порядке (sort()).
Создай новый отсортированный список с sorted(), не изменяя оригинал.
================================================
"""
cities4 = ['London', 'Amsterdam', 'Ryazan', 'Kishinev']
cities4.sort()
print(cities4)
goroda = sorted(cities4)
print(id(cities4), id(goroda))
print('----------------')
"""
7. Дополнительное задание
================================================
Создай список символов chars = list("programming").
Определи количество вхождений буквы "g".
Разверни список символов (reverse()).
Попробуй отсортировать список chars (sort()). Как изменится порядок букв?
"""
chars = list("programming")
print(chars)
chars.reverse()
print(chars)
chars.sort()
print(chars)
print('----------------')
"""
++++++++++++++++++++++++++++++++++++++++++++++++
Вложенные списки (массивы)
++++++++++++++++++++++++++++++++++++++++++++++++
================================================
1. Создание вложенного списка
================================================
Создай двумерный список matrix, содержащий 3 строки и 4 столбца со значениями от 1 до 12.
Выведи всю матрицу на экран.
Выведи вторую строку.
Выведи первый элемент третьей строки.
================================================
"""
matrix = [
    [1, 2, 3, 4],
    [5, 6, 7, 8],
    [9, 10, 11, 12],
]
print(matrix)
print(matrix[1])
print(matrix[2][0])
print('----------------')
"""
2. Изменение элементов вложенного списка
================================================
Замени все элементы первой строки на 0.
Замени последний элемент второй строки на "Python".
"""
matrix[0][0] = 0
matrix[0][1] = 0
matrix[0][2] = 0
matrix[0][3] = 0
matrix[1][3] = 'Python'
print(matrix)